nxp-mcuxpresso/mcux-sdk-examples/mcxn9xxevk/usb_examples/usb_device_video_virtual_camera/freertos/cm33_core0/virtual_camera.c
    USB_DeviceVideoApplicationSetDefault();

    if (kStatus_USB_Success !=
        USB_DeviceClassInit(CONTROLLER_ID, &g_UsbDeviceVideoConfigList, &g_UsbDeviceVideoVirtualCamera.deviceHandle))
    {
        usb_echo("USB device video virtual camera failed\r\n");
        return;
    }
    else
    {
        usb_echo("USB device video virtual camera demo\r\n");
        g_UsbDeviceVideoVirtualCamera.videoHandle = g_UsbDeviceVideoConfigList.config->classHandle;
    }

    USB_DeviceIsrEnable();

    /*Add one delay here to make the DP pull down long enough to allow host to detect the previous disconnection.*/
    SDK_DelayAtLeastUs(5000, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    USB_DeviceRun(g_UsbDeviceVideoVirtualCamera.deviceHandle);
}

#if USB_DEVICE_CONFIG_USE_TASK
void USB_DeviceTask(void *handle)
{
    while (1U)
    {
        USB_DeviceTaskFn(handle);
    }
}
#endif

void APP_task(void *handle)
{
    USB_DeviceApplicationInit();

#if USB_DEVICE_CONFIG_USE_TASK
    if (g_UsbDeviceVideoVirtualCamera.deviceHandle)
    {
        if (xTaskCreate(USB_DeviceTask,                                 /* pointer to the task */
                        "usb device task",                              /* task name for kernel awareness debugging */
                        5000L / sizeof(portSTACK_TYPE),                 /* task stack size */
                        g_UsbDeviceVideoVirtualCamera.deviceHandle,     /* optional task startup argument */
                        5U,                                             /* initial priority */
                        &g_UsbDeviceVideoVirtualCamera.deviceTaskHandle /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("usb device task create failed!\r\n");
            return;
        }
    }
#endif

    while (1U)
    {
    }
}

#if defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__)
int main(void)
#else
void main(void)
#endif
{
    BOARD_InitBootPins();
    BOARD_PowerMode_OD();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole();
    CLOCK_SetupExtClocking(BOARD_XTAL0_CLK_HZ);

    if (xTaskCreate(APP_task,                                            /* pointer to the task */
                    "app task",                                          /* task name for kernel awareness debugging */
                    5000L / sizeof(portSTACK_TYPE),                      /* task stack size */
                    &g_UsbDeviceVideoVirtualCamera,                      /* optional task startup argument */
                    4U,                                                  /* initial priority */
                    &g_UsbDeviceVideoVirtualCamera.applicationTaskHandle /* optional task handle to create */
                    ) != pdPASS)
    {
        usb_echo("app task create failed!\r\n");
#if (defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__))
        return 1U;
#else
        return;
#endif
    }

    vTaskStartScheduler();

#if (defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__))
    return 1U;
#endif
}
